Autodesk.Revit.DB.BackgroundStyle
Indicates the background style in rendering settings.
Since:
2013

Autodesk.Revit.DB.BackgroundStyle.Transparent
Transparent background

Autodesk.Revit.DB.BackgroundStyle.Image
Image background.

Autodesk.Revit.DB.BackgroundStyle.Color
Color background.

Autodesk.Revit.DB.BackgroundStyle.SkyVeryCloudy
Very cloudy sky background.

Autodesk.Revit.DB.BackgroundStyle.SkyCloudy
Cloudy sky background.

Autodesk.Revit.DB.BackgroundStyle.SkyFewClouds
Sky background with few clouds.

Autodesk.Revit.DB.BackgroundStyle.SkyVeryFewClouds
Sky background with very few clouds.

Autodesk.Revit.DB.BackgroundStyle.SkyNoClouds
Sky background without clouds.